In [40]:
import numpy as np
import pandas as pd
import seaborn as sn

In [56]:
df = pd.read_csv("C://Users//Dell//Downloads//Naive_Bayes//Social_Network_Ads.csv")
df.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [57]:
df_Gen = pd.get_dummies(data=df.Gender,columns={'Male':1,'Female':0},drop_first=True)
df_Gen.head()

   Male
0     1
1     1
2     0
3     0
4     1

In [58]:
df = pd.concat(objs=(df,df_Gen),axis=1)
df.head()

    User ID  Gender  Age  EstimatedSalary  Purchased  Male
0  15624510    Male   19            19000          0     1
1  15810944    Male   35            20000          0     1
2  15668575  Female   26            43000          0     0
3  15603246  Female   27            57000          0     0
4  15804002    Male   19            76000          0     1

In [59]:
df.drop('Gender',axis=1,inplace=True)
df.drop('User ID',axis=1,inplace=True)
X = df

In [64]:
X = df.drop('Purchased',axis=1)
X.head()

   Age  EstimatedSalary  Male
0   19            19000     1
1   35            20000     1
2   26            43000     0
3   27            57000     0
4   19            76000     1

In [6]:
from sklearn.preprocessing import StandardScaler
scaler = StandardScaler()
scaler.fit(X)
scaled_data = scaler.transform(X)

In [73]:
dfd = pd.DataFrame(scaled_data,columns=['Age','Estimated Salary','Male'])
dfd.head()

        Age  Estimated Salary      Male
0 -1.781797         -1.490046  1.020204
1 -0.253587         -1.460681  1.020204
2 -1.113206         -0.785290 -0.980196
3 -1.017692         -0.374182 -0.980196
4 -1.781797          0.183751  1.020204

In [76]:
df1 = pd.concat(objs=(dfd,df.Purchased),axis=1)
df1.head()

        Age  Estimated Salary      Male  Purchased
0 -1.781797         -1.490046  1.020204          0
1 -0.253587         -1.460681  1.020204          0
2 -1.113206         -0.785290 -0.980196          0
3 -1.017692         -0.374182 -0.980196          0
4 -1.781797          0.183751  1.020204          0

In [79]:
X = df1.drop('Purchased',axis=1)
y = df1.Purchased

In [80]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.33, random_state=42)

In [81]:
from sklearn.naive_bayes import GaussianNB
nb = GaussianNB()
classifier = nb.fit(X_train,y_train)

In [84]:
classifier.score(X_test,y_test)

0.8787878787878788

# Both are same we can use classifier.score or classifier.predict
# pre = classifier.predict(X_test)

In [91]:
from sklearn.metrics import classification_report
print(classification_report(y_test,pre))

              precision    recall  f1-score   support

           0       0.84      0.99      0.91        80
           1       0.97      0.71      0.82        52

    accuracy                           0.88       132
   macro avg       0.91      0.85      0.87       132
weighted avg       0.89      0.88      0.87       132